; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
  (on_board ?i - instrument ?s - satellite)
  (supports ?i - instrument ?m - mode)
  (pointing ?s - satellite ?d - direction)
  (power_avail ?s - satellite)
  (power_on ?i - instrument)
  (calibrated ?i - instrument)
  (have_image ?d - direction ?m - mode)
  (calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
          (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips_sat_x_1)
(:domain satellite)
(:objects
  satellite0 - satellite
  instrument0 - instrument
  satellite1 - satellite
  instrument1 - instrument
  satellite2 - satellite
  instrument2 - instrument
  spectrograph0 - mode
  groundstation0 - direction
  planet1 - direction
)
(:init
  (supports instrument0 spectrograph0)
  (calibration_target instrument0 groundstation0)
  (on_board instrument0 satellite0)
  (power_avail satellite0)
  (pointing satellite0 planet1)
  (supports instrument1 spectrograph0)
  (calibration_target instrument1 groundstation0)
  (on_board instrument1 satellite1)
  (power_avail satellite1)
  (pointing satellite1 planet1)
  (supports instrument2 spectrograph0)
  (calibration_target instrument2 groundstation0)
  (on_board instrument2 satellite2)
  (power_avail satellite2)
  (pointing satellite2 groundstation0)
)
(:goal (and
  (pointing satellite1 groundstation0)
  (pointing satellite2 groundstation0)
  (have_image planet1 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 3
2. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 3
3. (turn_to satellite1 groundstation0 planet1)
   deleted: (pointing satellite1 planet1)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 3
4. (turn_to satellite2 planet1 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet1)
   goals met: 1 of 3
5. (take_image satellite2 planet1 instrument2 spectrograph0)
   added: (have_image planet1 spectrograph0)
   goals met: 2 of 3
6. (turn_to satellite2 groundstation0 planet1)
   deleted: (pointing satellite2 planet1)
   added: (pointing satellite2 groundstation0)
   goals met: 3 of 3
